[Killed] BooleanLiteral
src/client-side-routing.ts:15:7
 
 export const handler = async (event: LambdaEdgeRequest) => {
   const request = event.Records[0].cf.request;
-  if (!path.extname(request.uri)) {
+  if (path.extname(request.uri)) {
     request.uri = '/index.html';
   }
killedBy: client-side-routing changes the request uri to /index.html when loading an non-asset page
statusReason: expected '/home' to equal '/index.html'
