[Killed] BooleanLiteral
src/bootstrap.ts:85:9
       mainConn,
       `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
     );
-    if (!serviceUserExists) {
+    if (serviceUserExists) {
       await query(
         mainConn,
killedBy: Handler - Unit creates DB and service user when missing; no CDC path
statusReason: expected false to be true
