[Timeout] ConditionalExpression
src/bootstrap.ts:42:7
   );
 
   let cdcUserSecret: { username: string; password: string } | undefined;
-  if (env.CDC_USER_SECRET) {
+  if (false) {
     const cdcRaw = (
       await secretClient.send(

[Timeout] ConditionalExpression
src/bootstrap.ts:42:7
   );
 
   let cdcUserSecret: { username: string; password: string } | undefined;
-  if (env.CDC_USER_SECRET) {
+  if (true) {
     const cdcRaw = (
       await secretClient.send(

[Killed] StringLiteral
src/bootstrap.ts:56:61
 
   const { username, password } = serviceSecret;
   const database =
-    env.APP_DATABASE_NAME ?? serviceSecret.username.replace('_user', '');
+    env.APP_DATABASE_NAME ?? serviceSecret.username.replace("", '');
   const schema = env.APP_SCHEMA_NAME ?? serviceSecret.username;
 
killedBy: Handler - Unit derives database and schema from service secret when env values are undefined (kills schema-fallback & string-literal mutants)
statusReason: expected 'Database \'myapp_user\' usernames are…' to equal 'Database \'myapp\' usernames are read…'

[Killed] BlockStatement
src/bootstrap.ts:85:29
       mainConn,
       `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
     );
-    if (!serviceUserExists) {
-      await query(
-        mainConn,
-        `CREATE USER ${username} WITH ENCRYPTED PASSWORD '${password}'`,
-      );
-    }
+    if (!serviceUserExists) {}
 
     // Validate the *cdc user*, if the user does not exist, invoke the create new user
killedBy: Handler - Unit creates DB and service user when missing; no CDC path
statusReason: expected [ …(3) ] to include 'CREATE USER myapp_user WITH ENCRYPTED…'

[Killed] ConditionalExpression
src/bootstrap.ts:85:9
       mainConn,
       `SELECT exists(SELECT FROM pg_roles WHERE rolname='${username}')`,
     );
-    if (!serviceUserExists) {
+    if (true) {
       await query(
         mainConn,
killedBy: Handler - Unit skips CREATE DATABASE and CREATE USER when they already exist
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/bootstrap.ts:93:9
     }
 
     // Validate the *cdc user*, if the user does not exist, invoke the create new user
-    if (cdcUserSecret) {
+    if (true) {
       const {
         rows: [{ exists: cdcUserExists }],
killedBy: Handler - Unit creates DB and service user when missing; no CDC path
statusReason: Cannot read properties of undefined (reading 'username')

[Killed] ConditionalExpression
src/bootstrap.ts:93:9
     }
 
     // Validate the *cdc user*, if the user does not exist, invoke the create new user
-    if (cdcUserSecret) {
+    if (false) {
       const {
         rows: [{ exists: cdcUserExists }],
killedBy: Handler - Unit creates CDC user if missing and applies CDC grants & publication
statusReason: expected [ …(4) ] to include 'SELECT exists(SELECT FROM pg_roles WH…'

[Killed] BlockStatement
src/bootstrap.ts:100:27
         mainConn,
         `SELECT exists(SELECT FROM pg_roles WHERE rolname='${cdcUserSecret.username}')`,
       );
-      if (!cdcUserExists) {
-        await query(
-          mainConn,
-          `CREATE USER ${cdcUserSecret.username} WITH ENCRYPTED PASSWORD '${cdcUserSecret.password}'`,
-        );
-      }
+      if (!cdcUserExists) {}
     }
   } finally {
killedBy: Handler - Unit creates CDC user if missing and applies CDC grants & publication
statusReason: expected [ …(5) ] to include 'CREATE USER cdc_user WITH ENCRYPTED P…'

[Killed] ConditionalExpression
src/bootstrap.ts:100:11
         mainConn,
         `SELECT exists(SELECT FROM pg_roles WHERE rolname='${cdcUserSecret.username}')`,
       );
-      if (!cdcUserExists) {
+      if (false) {
         await query(
           mainConn,
killedBy: Handler - Unit creates CDC user if missing and applies CDC grants & publication
statusReason: expected [ …(5) ] to include 'CREATE USER cdc_user WITH ENCRYPTED P…'

[Survived] StringLiteral
src/bootstrap.ts:121:30
   await serviceConn.connect();
   try {
     // Granting privileges to the service user
-    await query(serviceConn, `CREATE SCHEMA IF NOT EXISTS ${schema}`);
+    await query(serviceConn, ``);
     await query(
       serviceConn,

[Survived] StringLiteral
src/bootstrap.ts:136:7
     );
     await query(
       serviceConn,
-      `GRANT CREATE ON DATABASE ${database} TO ${username}`,
+      ``,
     );
     await query(serviceConn, `CREATE SCHEMA IF NOT EXISTS ${schema}`);

[Timeout] StringLiteral
src/bootstrap.ts:147:7
     );
     await query(
       serviceConn,
-      `ALTER DEFAULT PRIVILEGES IN SCHEMA ${schema} GRANT ALL PRIVILEGES ON TABLES TO ${username}`,
+      ``,
     );
     await query(

[Timeout] ConditionalExpression
src/bootstrap.ts:158:7
     await serviceConn.end();
   }
 
-  if (cdcUserSecret) {
+  if (false) {
     // Minimal DB-level grants for CDC user on the PG DB
     const cdcDbConn = new Client({

[Timeout] ConditionalExpression
src/bootstrap.ts:158:7
     await serviceConn.end();
   }
 
-  if (cdcUserSecret) {
+  if (true) {
     // Minimal DB-level grants for CDC user on the PG DB
     const cdcDbConn = new Client({

[Killed] ObjectLiteral
src/bootstrap.ts:160:34
 
   if (cdcUserSecret) {
     // Minimal DB-level grants for CDC user on the PG DB
-    const cdcDbConn = new Client({
-      database,
-      user: mainSecret.username,
-      password: mainSecret.password,
-      host: env.RDS_HOST,
-      port: 5432,
-    });
+    const cdcDbConn = new Client({});
     await cdcDbConn.connect();
     try {
killedBy: Handler - Unit creates CDC user if missing and applies CDC grants & publication
statusReason: expected [] to include 'GRANT CONNECT ON DATABASE app_databas…'

[Killed] BlockStatement
src/bootstrap.ts:168:9
       port: 5432,
     });
     await cdcDbConn.connect();
-    try {
-      await query(
-        cdcDbConn,
-        `GRANT CONNECT ON DATABASE ${database} TO ${cdcUserSecret.username}`,
-      );
-      await query(
-        cdcDbConn,
-        `GRANT SELECT ON ALL TABLES IN SCHEMA ${schema} TO ${cdcUserSecret.username}`,
-      );
-
-      // Grant RDS replication capability (Aurora/RDS-PostgreSQL)
-      await query(
-        cdcDbConn,
-        `GRANT rds_replication, rds_superuser TO ${cdcUserSecret.username}`,
-      );
-      await query(
-        cdcDbConn,
-        `CREATE PUBLICATION IF NOT EXISTS cdc_publication FOR ALL TABLES`,
-      );
-    } finally {
+    try {} finally {
       await cdcDbConn.end();
     }
killedBy: Handler - Unit creates CDC user if missing and applies CDC grants & publication
statusReason: expected [] to include 'GRANT CONNECT ON DATABASE app_databas…'

[Timeout] StringLiteral
src/bootstrap.ts:171:9
     try {
       await query(
         cdcDbConn,
-        `GRANT CONNECT ON DATABASE ${database} TO ${cdcUserSecret.username}`,
+        ``,
       );
       await query(
