[Killed] ConditionalExpression
src/simple-rotate-secret.ts:102:9
   let currentVersion: string | undefined = undefined;
 
   for (const version in secretMetadata.VersionIdsToStages) {
-    if (secretMetadata.VersionIdsToStages[version].includes('AWSCURRENT')) {
+    if (false) {
       currentVersion = version;
       break;
killedBy: simple-rotate-secret finishSecret should update the new secret to AWSCURRENT and remove existing from AWSCURRENT
statusReason: Error
