[Timeout] ConditionalExpression
src/verify-header-jwt.ts:31:7
 };
 
 export async function handler(event): Promise<{ isAuthorized: boolean }> {
-  if (event && event.headers) {
+  if (false) {
     const [tokenValid, originValid] = await Promise.all([
       verifyToken(event.headers.authorization),

[Timeout] BooleanLiteral
src/verify-header-jwt.ts:43:7
 }
 
 async function verifyHeader(headerValue: string | undefined): Promise<boolean> {
-  if (!headerValue) {
+  if (headerValue) {
     return false;
   }
